# ==========================================
# โจทย์ข้อที่ 4: คำนวณค่าไฟฟ้า
# Input: จำนวนหน่วยไฟฟ้าที่ใช้ (จำนวนเต็มบวก)
# เงื่อนไขคิดราคา:
#   - 50 หน่วยแรก คิดหน่วยละ 3 บาท
#   - ส่วนที่เกิน 50 หน่วยขึ้นไป คิดหน่วยละ 5 บาท
# Output: ค่าไฟฟ้าทั้งหมด (จำนวนเต็ม)
# ตัวอย่าง: 
#   - ใช้ 30 หน่วย -> 30 * 3 = 90 บาท
#   - ใช้ 70 หน่วย -> (50 * 3) + (20 * 5) = 250 บาท
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
num1 = int(input())
num2 = int(input())
num3 = int(input())
float (num1 == num2) and (num2 == num3)
print("สามเหลี่ยมด้านเท่า")
float (num1 == num2) or (num2 == num3) or (num1 == num3)
print("สามเหลี่ยมหน้าจั่ว")
